# frozen_string_literal: true

tap 'd12frosted/emacs-plus'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/core'
tap 'wez/wezterm'

brew 'tree'
brew 'btop'
brew 'wget'

brew 'neovim', args: %w[HEAD]
brew 'd12frosted/emacs-plus/emacs-plus@28', args: %w[with-modern-doom3-icon with-native-comp]

brew 'chruby'
brew 'ruby-install'
brew 'stylua'

brew 'golang'
brew 'golangci-lint'

brew 'rust-analyzer'

cask 'font-iosevka-aile'
cask 'font-iosevka-nerd-font'
cask 'font-jetbrains-mono-nerd-font'

cask 'brave-browser'
cask 'librewolf'
cask 'spotify'
cask 'visual-studio-code'
cask 'docker'
cask 'appcleaner'
cask 'qutebrowser'
cask 'alacritty'
cask 'wez/wezterm/wezterm'
cask 'logseq'
cask 'obsidian'

cask 'discord'
cask 'gog-galaxy'

cask 'calibre'
